{
  "source": "Microsoft Research",
  "total_articles": 10,
  "updated_at": "2026-01-30 01:13:35",
  "articles": [
    {
      "source": "Microsoft Research",
      "title": "UniRG: Scaling medical imaging report generation with multimodal reinforcement learning",
      "url": "https://www.microsoft.com/en-us/research/blog/unirg-scaling-medical-imaging-report-generation-with-multimodal-reinforcement-learning/",
      "date": "2026-01-27",
      "summary": "AI can help generate medical image reports, but today’s models struggle with varying reporting schemes. Learn how UniRG uses reinforcement learning to boost performance of medical vision-language models.",
      "author": "Sheng Zhang, Flora Liu, Guanghui Qin, Mu Wei, Hoifung Poon",
      "categories": [
        "Research Blog"
      ],
      "collected_at": "2026-01-30 01:12:58"
    },
    {
      "source": "Microsoft Research",
      "title": "Multimodal reinforcement learning with agentic verifier for AI agents",
      "url": "https://www.microsoft.com/en-us/research/blog/multimodal-reinforcement-learning-with-agentic-verifier-for-ai-agents/",
      "date": "2026-01-20",
      "summary": "Argos improves multimodal RL by evaluating whether an agent’s reasoning aligns with what it observes over time. The approach reduces visual hallucinations and produces more reliable, data-efficient agents for real-world applications.",
      "author": "Reuben Tan, Baolin Peng, Zhengyuan Yang, Oier Mees, Jianfeng Gao",
      "categories": [
        "Research Blog"
      ],
      "collected_at": "2026-01-30 01:12:58"
    },
    {
      "source": "Microsoft Research",
      "title": "OptiMind: A small language model with optimization expertise",
      "url": "https://www.microsoft.com/en-us/research/blog/optimind-a-small-language-model-with-optimization-expertise/",
      "date": "2026-01-15",
      "summary": "OptiMind is a small language model that converts business operation challenges, described naturally, into mathematical formulations that optimization software can solve. It reduces formulation time & errors & enables fast, privacy-preserving local use.",
      "author": "Xinzhi Zhang, Zeyi Chen, Humishka Hope, Hugo Barbalho, Konstantina Mellou, Marco Molinaro, Janardhan (Jana) Kulkarni, Ishai Menache, Sirui Li",
      "categories": [
        "Research Blog"
      ],
      "collected_at": "2026-01-30 01:12:58"
    },
    {
      "source": "Microsoft Research",
      "title": "Agent Lightning: Adding reinforcement learning to AI agents without code rewrites",
      "url": "https://www.microsoft.com/en-us/research/blog/agent-lightning-adding-reinforcement-learning-to-ai-agents-without-code-rewrites/",
      "date": "2025-12-11",
      "summary": "By decoupling how agents work from how they’re trained, Agent Lightning turns each step an agent takes into data for reinforcement learning. This makes it easy for developers to improve agent performance with almost zero code changes.",
      "author": "Xufang Luo, Yuge Zhang, Zhiyuan He, Zilong Wang, Dongsheng Li, Luna K. Qiu, Yuqing Yang",
      "categories": [
        "Research Blog"
      ],
      "collected_at": "2026-01-30 01:12:58"
    },
    {
      "source": "Microsoft Research",
      "title": "Promptions helps make AI prompting more precise with dynamic UI controls",
      "url": "https://www.microsoft.com/en-us/research/blog/promptions-helps-make-ai-prompting-more-precise-with-dynamic-ui-controls/",
      "date": "2025-12-10",
      "summary": "Promptions helps developers add dynamic, context-aware controls to chat interfaces so users can guide generative AI responses. It lets users shape outputs quickly without writing long instructions.",
      "author": "Sean Rintel, Advait Sarkar, Jack Williams, Nicholas Wilson, Richard Banks, Neeltje Berger, Philipp Steinacher, Payod Panda, Ian Drosos",
      "categories": [
        "Research Blog"
      ],
      "collected_at": "2026-01-30 01:12:58"
    },
    {
      "source": "Microsoft Research",
      "title": "GigaTIME: Scaling tumor microenvironment modeling using virtual population generated by multimodal AI",
      "url": "https://www.microsoft.com/en-us/research/blog/gigatime-scaling-tumor-microenvironment-modeling-using-virtual-population-generated-by-multimodal-ai/",
      "date": "2025-12-09",
      "summary": "Using AI-generated virtual populations, Microsoft researchers uncovered hidden cellular patterns that could reshape how we understand and treat cancer.",
      "author": "Hoifung Poon, Jeya Maria Jose Valanarasu, Naoto Usuyama, Sheng Wang",
      "categories": [
        "Research Blog"
      ],
      "collected_at": "2026-01-30 01:12:58"
    },
    {
      "source": "Microsoft Research",
      "title": "Ideas: Community building, machine learning, and the future of AI",
      "url": "https://www.microsoft.com/en-us/research/podcast/ideas-community-building-machine-learning-and-the-future-of-ai/",
      "date": "2025-12-01",
      "summary": "As the Women in Machine Learning Workshop (WiML) marks its 20th annual gathering, cofounders, friends, and collaborators Jenn Wortman Vaughan and Hanna Wallach reflect on WiML’s evolution, navigating the field of ML, and their work in responsible AI.",
      "author": "Jenn Wortman Vaughan, Hanna Wallach",
      "categories": [
        "Microsoft Research Podcast"
      ],
      "collected_at": "2026-01-30 01:12:58"
    },
    {
      "source": "Microsoft Research",
      "title": "Reducing Privacy leaks in AI: Two approaches to contextual integrity",
      "url": "https://www.microsoft.com/en-us/research/blog/reducing-privacy-leaks-in-ai-two-approaches-to-contextual-integrity/",
      "date": "2025-11-25",
      "summary": "New research explores two ways to give AI agents stronger privacy safeguards grounded in contextual integrity. One adds lightweight, inference-time checks; the other builds contextual awareness directly into models through reasoning and RL.",
      "author": "Gbola Afonja, Huseyin Atahan Inan, Qingwei Lin 林庆维, Saravan Rajmohan, Robert Sim, Xiaoting Qin, Jue Zhang, Lukas Wutschitz",
      "categories": [
        "Research Blog"
      ],
      "collected_at": "2026-01-30 01:12:58"
    },
    {
      "source": "Microsoft Research",
      "title": "Fara-7B: An Efficient Agentic Model for Computer Use",
      "url": "https://www.microsoft.com/en-us/research/blog/fara-7b-an-efficient-agentic-model-for-computer-use/",
      "date": "2025-11-24",
      "summary": "Fara-7B is our first agentic small language model for computer use. This experimental model includes robust safety measures to aid responsible deployment. Despite its size, Fara-7B holds its own against larger, more resource-intensive agentic systems.",
      "author": "Ahmed Awadallah, Akshay Nambi, Alexey Taymanov, Aravind Rajeswaran, Corby Rosset, Hussein Mozannar, Spencer Whitehead, Vibhav Vineet, Yash Lara, Yash Pandya, Andrew Zhao",
      "categories": [
        "Research Blog"
      ],
      "collected_at": "2026-01-30 01:12:58"
    },
    {
      "source": "Microsoft Research",
      "title": "MMCTAgent: Enabling multimodal reasoning over large video and image collections",
      "url": "https://www.microsoft.com/en-us/research/blog/mmctagent-enabling-multimodal-reasoning-over-large-video-and-image-collections/",
      "date": "2025-11-12",
      "summary": "MMCTAgent enables dynamic multimodal reasoning with iterative planning and reflection. Built on Microsoft’s AutoGen framework, it integrates language, vision, and temporal understanding for complex tasks like long video and image analysis.",
      "author": "Akshay Nambi, Kavyansh Chourasia, Tanuja Ganu",
      "categories": [
        "Research Blog"
      ],
      "collected_at": "2026-01-30 01:12:58"
    }
  ]
}