{
  "source": "NVIDIA Blog",
  "total_articles": 18,
  "updated_at": "2026-01-30 01:13:35",
  "articles": [
    {
      "source": "NVIDIA Blog",
      "title": "Mercedes-Benz Unveils New S-Class Built on NVIDIA DRIVE AV, Which Enables an L4-Ready Architecture",
      "url": "https://blogs.nvidia.com/blog/mercedes-benz-l4-s-class-drive-av-platform/",
      "date": "2026-01-29",
      "summary": "Mercedes-Benz is marking 140 years of automotive innovation with a new S-Class built for the AI era, bringing together automotive safety and NVIDIA’s advanced autonomous driving platform to enable a level 4-ready architecture designed for trust. The new S-Class with MB.OS, which will be equipped with the NVIDIA DRIVE Hyperion architecture and full-stack NVIDIA DRIVE",
      "author": "Jessica Soares",
      "categories": [
        "Driving",
        "NVIDIA DRIVE"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Into the Omniverse: Physical AI Open Models and Frameworks Advance Robots and Autonomous Systems",
      "url": "https://blogs.nvidia.com/blog/physical-ai-open-models-robot-autonomous-systems-omniverse/",
      "date": "2026-01-29",
      "summary": "Open source has become essential for driving innovation in robotics and autonomy. By providing access to critical infrastructure — from simulation frameworks to AI models — NVIDIA is enabling collaborative development that accelerates the path to safer, more capable autonomous systems.",
      "author": "Akhil Docca",
      "categories": [
        "Pro Graphics",
        "Robotics",
        "Artificial Intelligence",
        "Cosmos",
        "Into the Omniverse",
        "Isaac",
        "Jetson",
        "Omniverse",
        "Open Source",
        "Physical AI"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "GeForce NOW Brings GeForce RTX Gaming to Linux PCs",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-linux/",
      "date": "2026-01-29",
      "summary": "Get ready to game — the native GeForce NOW app for Linux PCs is now available in beta, letting Linux desktops tap directly into GeForce RTX performance from the cloud. Alongside the expansion comes ten new games, including The Bard’s Tale IV: Director’s Cut and The Bard’s Tale Trilogy for a leveled-up gaming weekend. And",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Accelerating Science: A Blueprint for a Renewed National Quantum Initiative",
      "url": "https://blogs.nvidia.com/blog/national-quantum-initiative/",
      "date": "2026-01-28",
      "summary": "Quantum technologies are rapidly emerging as foundational capabilities for economic competitiveness, national security and scientific leadership in the 21st century. Sustained U.S. leadership in quantum information science is critical to ensuring that breakthroughs in computing, sensing, networking and materials translate into secure technologies and industries, a skilled domestic workforce and long-term strategic advantage. To secure",
      "author": "Krysta Svore",
      "categories": [
        "Corporate",
        "Quantum Computing"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA Launches Earth-2 Family of Open Models — the World’s First Fully Open, Accelerated Set of Models and Tools for AI Weather",
      "url": "https://blogs.nvidia.com/blog/nvidia-earth-2-open-models/",
      "date": "2026-01-26",
      "summary": "At the American Meteorological Society’s Annual Meeting, NVIDIA today unveiled a new NVIDIA Earth-2 family of open models, libraries and frameworks for weather and climate AI, offering the world’s first fully open, production-ready weather AI software stack.",
      "author": "Mike Pritchard",
      "categories": [
        "Generative AI",
        "Artificial Intelligence",
        "Climate",
        "Energy",
        "NVIDIA Research",
        "Open Source",
        "Science",
        "Scientific Visualization",
        "Simulation and Design",
        "Social Impact",
        "Sovereign AI"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA DRIVE AV Raises the Bar for Vehicle Safety as Mercedes-Benz CLA Earns Top Euro NCAP Award",
      "url": "https://blogs.nvidia.com/blog/drive-av-mercedes-benz-cla-euro-ncap-safety-award/",
      "date": "2026-01-22",
      "summary": "AI-powered driver assistance technologies are becoming standard equipment, fundamentally changing how vehicle safety is assessed and validated. The recent recognition of the Mercedes-Benz CLA as Euro NCAP’s Best Performer of 2025 underscores this shift, as the vehicle combines traditional passive safety features with NVIDIA DRIVE AV software to achieve the highest overall safety score of",
      "author": "Ali Kani",
      "categories": [
        "Driving",
        "NVIDIA DRIVE"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "How to Get Started With Visual Generative AI on NVIDIA RTX PCs",
      "url": "https://blogs.nvidia.com/blog/rtx-ai-garage-comfyui-tutorial/",
      "date": "2026-01-22",
      "summary": "AI-powered content generation is now embedded in everyday tools like Adobe and Canva, with a slew of agencies and studios incorporating the technology into their workflows. Image models now deliver photorealistic results consistently, video models can generate long and coherent clips, and both can follow creative directions. Creators are increasingly running these workflows locally on",
      "author": "Joel Pennington",
      "categories": [
        "Generative AI",
        "Artificial Intelligence",
        "Creators",
        "GeForce RTX",
        "RTX AI Garage"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "From Pilot to Profit: Survey Reveals the Financial Services Industry Is Doubling Down on AI Investment and Open Source",
      "url": "https://blogs.nvidia.com/blog/ai-in-financial-services-survey-2026/",
      "date": "2026-01-22",
      "summary": "AI has taken center stage in financial services, automating the research and execution behind algorithmic trading and helping banks more accurately detect fraud and money laundering — all while improving risk management practices and expediting document processing. The sixth annual “NVIDIA State of AI in Financial Services” report, based on a survey of more than",
      "author": "Kevin Levitt",
      "categories": [
        "Generative AI",
        "Agentic AI",
        "Artificial Intelligence",
        "Financial Services",
        "Open Source"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Flight Controls Are Cleared for Takeoff on GeForce NOW",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-flight-controls/",
      "date": "2026-01-22",
      "summary": "The wait is over, pilots. Flight control support — one of the most community-requested features for GeForce NOW — is live starting today, following its announcement at CES earlier this month. Virtual captains can now bring dedicated flight gear into the cloud and feel every roll, yaw and throttle change with even more precision, starting",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "‘Largest Infrastructure Buildout in Human History’: Jensen Huang on AI’s ‘Five-Layer Cake’ at Davos",
      "url": "https://blogs.nvidia.com/blog/davos-wef-blackrock-ceo-larry-fink-jensen-huang/",
      "date": "2026-01-21",
      "summary": "AI is becoming the foundation of the “largest infrastructure buildout in human history,” spanning energy and computing infrastructure, AI models and applications, NVIDIA founder and CEO Jensen Huang said during a World Economic Forum discussion with BlackRock CEO Larry Fink.",
      "author": "Brian Caulfield",
      "categories": [
        "Corporate",
        "Artificial Intelligence"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Survive the Quarantine Zone and More With Devolver Digital Games on GeForce NOW",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-quarantine-zone/",
      "date": "2026-01-15",
      "summary": "NVIDIA kicked off the year at CES, where the crowd buzzed about the latest gaming announcements — including the native GeForce NOW app for Linux and Amazon Fire TV sticks, community-requested flight-control support and a stacked AAA lineup for the year. Check out what the creators of the YouTube channels Cloud Gaming Battle and Anytime",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "CEOs of NVIDIA and Lilly Share ‘Blueprint for What Is Possible’ in AI and Drug Discovery",
      "url": "https://blogs.nvidia.com/blog/jpmorgan-healthcare-nvidia-lilly/",
      "date": "2026-01-13",
      "summary": "NVIDIA and Lilly are putting together “a blueprint for what is possible in the future of drug discovery,” NVIDIA founder and CEO Jensen Huang told attendees at a fireside chat Monday with Dave Ricks, chair and CEO of Lilly. The conversation — which took place during the annual J.P. Morgan Healthcare Conference in San Francisco",
      "author": "Isha Salian",
      "categories": [
        "Corporate",
        "Generative AI",
        "Artificial Intelligence",
        "Healthcare and Life Sciences",
        "Social Impact"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "AI’s Next Revolution: Multiply Labs Is Scaling Robotics-Driven Cell Therapy Biomanufacturing Labs",
      "url": "https://blogs.nvidia.com/blog/multiply-labs-isaac-omniverse/",
      "date": "2026-01-12",
      "summary": "Startup works with leading cell therapy companies to bring robotics manufacturing into the clean room, reducing costs by more than 70% while accelerating output compared with legacy systems.",
      "author": "Scott Martin",
      "categories": [
        "Robotics",
        "Healthcare and Life Sciences",
        "NVIDIA Isaac Sim",
        "Omniverse Enterprise",
        "Social Impact"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA Unveils Multi-Agent Intelligent Warehouse and Catalog Enrichment AI Blueprints to Power the Retail Pipeline",
      "url": "https://blogs.nvidia.com/blog/multi-agent-intelligent-warehouse-and-catalog-enrichment-blueprints/",
      "date": "2026-01-09",
      "summary": "Every “that was easy” shopping moment is made possible by teams working to hit shipping deadlines, scrambling to fix missing product details and striving to provide curated shopping experiences. Behind the scenes, workers are dealing with the reality of aging systems, siloed data and rising customer expectations — a combination that makes consistency and speed",
      "author": "Cynthia Countouris",
      "categories": [
        "Generative AI",
        "Agentic AI",
        "Nemotron",
        "NVIDIA Blueprints",
        "Open Source",
        "Retail"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "AI Copilot Keeps Berkeley’s X-Ray Particle Accelerator on Track",
      "url": "https://blogs.nvidia.com/blog/ai-copilot-berkeley-x-ray-particle-accelerator/",
      "date": "2026-01-08",
      "summary": "In the rolling hills of Berkeley, California, an AI agent is supporting high-stakes physics experiments at the Advanced Light Source (ALS) particle accelerator. Researchers at the Lawrence Berkeley National Laboratory ALS facility recently deployed the Accelerator Assistant, a large language model (LLM)-driven system to keep X-ray research on track. The Accelerator Assistant — powered by",
      "author": "Scott Martin",
      "categories": [
        "Generative AI",
        "GPU Computing"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Japan Science and Technology Agency Develops NVIDIA-Powered Moonshot Robot for Elderly Care",
      "url": "https://blogs.nvidia.com/blog/japan-science-technology-agency-develops-moonshot-robot/",
      "date": "2026-01-08",
      "summary": "The next universal technology since the smartphone is on the horizon — and it may be a little less pocket friendly. The Moonshot research program, funded by the Japan Science and Technology Agency and accelerated by NVIDIA AI and robotics technologies, is working to create a world by 2050 where AI-powered, autonomously learning robots are",
      "author": "Zoe Kessler",
      "categories": [
        "Research",
        "Robotics",
        "GPU",
        "NVIDIA Isaac Sim",
        "NVIDIA Jetson",
        "NVIDIA RTX"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "More Ways to Play, More Games to Love — GeForce NOW Wraps CES With Linux Support, Fire TV App, Flight Stick Controls",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-ces-2026-recap/",
      "date": "2026-01-08",
      "summary": "NVIDIA is wrapping up a big week at the CES trade show with a set of GeForce NOW announcements that are bringing more ways to play and more games to the cloud. From new native apps for Linux and Amazon Fire TV streaming sticks to hands-on throttle-and-stick (HOTAS) support for simulation fans and a new",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2026-01-30 01:12:56"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Steel, Sensors and Silicon: How Caterpillar Is Bringing Edge AI to the Jobsite",
      "url": "https://blogs.nvidia.com/blog/caterpillar-ces-2026/",
      "date": "2026-01-07",
      "summary": "At CES, Caterpillar reveals how it’s integrating NVIDIA technologies, from NVIDIA Jetson Thor to speech models, to transform the world’s heavy industries.",
      "author": "Madison Huang",
      "categories": [
        "Driving",
        "Robotics"
      ],
      "collected_at": "2026-01-30 01:12:56"
    }
  ]
}