{
  "source": "NVIDIA News",
  "total_articles": 20,
  "updated_at": "2026-01-08 01:04:04",
  "articles": [
    {
      "source": "NVIDIA News",
      "title": "Steel, Sensors and Silicon: How Caterpillar Is Bringing Edge AI to the Jobsite",
      "url": "https://blogs.nvidia.com/blog/caterpillar-ces-2026/",
      "date": "2026-01-07",
      "summary": "At CES, Caterpillar reveals how it’s integrating NVIDIA technologies, from NVIDIA Jetson Thor to speech models, to transform the world’s heavy industries.",
      "author": "Madison Huang",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "From Warehouse to Wallet: New State of AI in Retail and CPG Survey Uncovers How AI Is Rewiring Supply Chains and Customer Experiences",
      "url": "https://blogs.nvidia.com/blog/ai-in-retail-cpg-survey-2026/",
      "date": "2026-01-07",
      "summary": "AI has transformed retail and consumer packaged goods (CPG) operations, enhancing customer analysis and segmentation to enable greater personalization for marketing and advertising, and boosting the speed and accuracy of demand forecasting for supply chains and logistics. Companies are also raising the bar for customer engagement through intelligent digital shopping assistants and catalog enrichment by",
      "author": "Cynthia Countouris",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "Siemens and NVIDIA Expand Partnership to Build the Industrial AI Operating System",
      "url": "http://nvidianews.nvidia.com/news/siemens-and-nvidia-expand-partnership-industrial-ai-operating-system",
      "date": "2026-01-06",
      "summary": "Siemens and NVIDIA today announced a significant expansion of their strategic partnership to bring artificial intelligence into the real world.",
      "author": "",
      "categories": [
        "Press Releases"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA Brings GeForce RTX Gaming to More Devices With New GeForce NOW Apps for Linux PC and Amazon Fire TV",
      "url": "https://blogs.nvidia.com/blog/geforce-now-ces-2026/",
      "date": "2026-01-06",
      "summary": "Announced at the CES trade show running this week in Las Vegas, NVIDIA is bringing more devices, more games and more ways to play to its GeForce NOW cloud gaming service. Powered by GeForce RTX 5080-class performance on the NVIDIA Blackwell RTX platform, GeForce NOW Ultimate continues to raise the bar for PC gamers streaming",
      "author": "GeForce NOW Community",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA RTX Accelerates 4K AI Video Generation on PC With LTX-2 and ComfyUI Upgrades",
      "url": "https://blogs.nvidia.com/blog/rtx-ai-garage-ces-2026-open-models-video-generation/",
      "date": "2026-01-06",
      "summary": "2025 marked a breakout year for AI development on PC. PC-class small language models (SLMs) improved accuracy by nearly 2x over 2024, dramatically closing the gap with frontier cloud-based large language models (LLMs). AI PC developer tools including Ollama, ComfyUI, llama.cpp and Unsloth have matured, their popularity has doubled year over year and the number",
      "author": "Gerardo Delgado",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA DLSS 4.5, Path Tracing and G-SYNC Pulsar Supercharge Gameplay With Enhanced Performance and Visuals",
      "url": "https://blogs.nvidia.com/blog/dlss-path-tracing-g-sync-pulsar-ces-2026/",
      "date": "2026-01-06",
      "summary": "At the CES trade show, NVIDIA today announced DLSS 4.5, which introduces Dynamic Multi Frame Generation, a new 6X Multi Frame Generation mode and a second-generation transformer model for DLSS Super Resolution, so gamers can experience the latest and greatest titles with enhanced performance and visuals. Over 250 games and apps now support NVIDIA DLSS",
      "author": "Jason Paul",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA Rubin Platform, Open Models, Autonomous Driving: NVIDIA Presents Blueprint for the Future at CES",
      "url": "https://blogs.nvidia.com/blog/2026-ces-special-presentation/",
      "date": "2026-01-05",
      "summary": "NVIDIA founder and CEO Jensen Huang took the stage at the Fontainebleau Las Vegas today to open CES 2026, declaring that AI is scaling into every domain and every device. “Computing has been fundamentally reshaped as a result of accelerated computing, as a result of artificial intelligence,” Huang said. “What that means is some $10",
      "author": "Brian Caulfield",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA BlueField-Powered Cybersecurity and Acceleration Arrive on NVIDIA Enterprise AI Factory Validated Design",
      "url": "https://blogs.nvidia.com/blog/bluefield-cybersecurity-acceleration-enterprise-ai-factory-validated-design/",
      "date": "2026-01-05",
      "summary": "AI is powering breakthroughs across industries, helping enterprises operate with greater intelligence and speed. As AI factories scale, the next generation of enterprise AI depends on infrastructure that can efficiently manage data, secure every stage of the pipeline and accelerate the core services that move, protect and process information alongside AI workloads. NVIDIA has expanded",
      "author": "Itay Ozery",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA DGX SuperPOD Sets the Stage for Rubin-Based Systems",
      "url": "https://blogs.nvidia.com/blog/dgx-superpod-rubin/",
      "date": "2026-01-05",
      "summary": "NVIDIA DGX SuperPOD is paving the way for large-scale system deployments built on the NVIDIA Rubin platform — the next leap forward in AI computing. At the CES trade show in Las Vegas, NVIDIA today introduced the Rubin platform, comprising six new chips designed to deliver one incredible AI supercomputer, and engineered to accelerate agentic",
      "author": "Charlie Boyle",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA DGX Spark and DGX Station Power the Latest Open-Source and Frontier Models From the Desktop",
      "url": "https://blogs.nvidia.com/blog/dgx-spark-and-station-open-source-frontier-models/",
      "date": "2026-01-05",
      "summary": "Open-source AI is accelerating innovation across industries, and NVIDIA DGX Spark and DGX Station are built to help developers turn innovation into impact. NVIDIA today unveiled at the CES trade show how the DGX Spark and DGX Station deskside AI supercomputers let developers harness the latest open and frontier AI models on a local deskside",
      "author": "Chris Marriott",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA Expands Global DRIVE Hyperion Ecosystem to Accelerate the Road to Full Autonomy",
      "url": "https://blogs.nvidia.com/blog/global-drive-hyperion-ecosystem-full-autonomy/",
      "date": "2026-01-05",
      "summary": "At the CES trade show running this week in Las Vegas, NVIDIA announced that the global DRIVE Hyperion ecosystem is expanding to include tier 1 suppliers, automotive integrators and sensor partners, including Aeva, AUMOVIO, Astemo, Arbe, Bosch, Hesai, Magna, Omnivision, Quanta, Sony and ZF Group. This builds on collaborations unveiled at NVIDIA GTC Washington, D.C.,",
      "author": "Mo Poorsartep",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA BlueField-4 Powers New Class of AI-Native Storage Infrastructure for the Next Frontier of AI",
      "url": "http://nvidianews.nvidia.com/news/nvidia-bluefield-4-powers-new-class-of-ai-native-storage-infrastructure-for-the-next-frontier-of-ai",
      "date": "2026-01-05",
      "summary": "NVIDIA today announced that the NVIDIA BlueField®-4 data processor, part of the full-stack NVIDIA BlueField platform, powers NVIDIA Inference Context Memory Storage Platform, a new class of AI-native storage infrastructure for the next frontier of AI.",
      "author": "",
      "categories": [
        "Press Releases"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA Kicks Off the Next Generation of AI With Rubin — Six New Chips, One Incredible AI Supercomputer",
      "url": "http://nvidianews.nvidia.com/news/rubin-platform-ai-supercomputer",
      "date": "2026-01-05",
      "summary": "NVIDIA today kickstarted the next generation of AI with the launch of the NVIDIA Rubin platform, comprising six new chips designed to deliver one incredible AI supercomputer.",
      "author": "",
      "categories": [
        "Press Releases"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA Releases New Physical AI Models as Global Partners Unveil Next-Generation Robots",
      "url": "http://nvidianews.nvidia.com/news/nvidia-releases-new-physical-ai-models-as-global-partners-unveil-next-generation-robots",
      "date": "2026-01-05",
      "summary": "NVIDIA today announced new open models, frameworks and AI infrastructure for physical AI, and unveiled robots for every industry from global partners.",
      "author": "",
      "categories": [
        "Press Releases"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA DRIVE AV Software Debuts in All-New Mercedes-Benz CLA",
      "url": "https://blogs.nvidia.com/blog/drive-av-software-mercedes-benz-cla/",
      "date": "2026-01-05",
      "summary": "NVIDIA is enabling a new era of AI-defined driving, bringing its NVIDIA DRIVE AV software with enhanced level 2 point-to-point driver assistance capabilities to U.S. roads, expected by end of this year — starting with Mercedes-Benz, a long-standing partner in advancing safe, intelligent mobility. The all-new Mercedes-Benz CLA — the brand’s first vehicle featuring the",
      "author": "Jessica Soares",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA Unveils New Open Models, Data and Tools to Advance AI Across Every Industry",
      "url": "https://blogs.nvidia.com/blog/open-models-data-tools-accelerate-ai/",
      "date": "2026-01-05",
      "summary": "Expanding the open model universe, NVIDIA today released new open models, data and tools to advance AI across every industry. These models — spanning the NVIDIA Nemotron family for agentic AI, the NVIDIA Cosmos platform for physical AI, the new NVIDIA Alpamayo family for autonomous vehicle development, NVIDIA Isaac GR00T for robotics and NVIDIA Clara",
      "author": "Kari Briski",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA Announces Alpamayo Family of Open-Source AI Models and Tools to Accelerate Safe, Reasoning-Based Autonomous Vehicle Development",
      "url": "http://nvidianews.nvidia.com/news/alpamayo-autonomous-vehicle-development",
      "date": "2026-01-05",
      "summary": "NVIDIA today unveiled the NVIDIA Alpamayo family of open AI models, simulation tools and datasets designed to accelerate the next era of safe, reasoning‑based autonomous vehicle (AV) development.",
      "author": "",
      "categories": [
        "Press Releases"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "GeForce NOW Rings In 2026 With 14 New Games in January",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-january-2026/",
      "date": "2026-01-01",
      "summary": "New year, new games, all with RTX 5080-powered cloud energy. GeForce NOW is kicking off 2026 by looking back at an unforgettable year of wins and wildly high frame rates. From streams of the biggest blockbusters to new ways to play anywhere, members showed all year what happens when great games meet serious GeForce performance",
      "author": "GeForce NOW Community",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "Make Spirits Bright With Holiday Hits on GeForce NOW",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-holiday-2025/",
      "date": "2025-12-25",
      "summary": "Holiday lights are twinkling, hot cocoa’s on the stove and gamers are settling in for a well-earned break. Whether staying in or heading on a winter getaway, GeForce NOW makes it easy to keep gaming from anywhere. Stream the 13 new games joining GeForce NOW this week across devices — including laptops, tablets and mobile",
      "author": "GeForce NOW Community",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    },
    {
      "source": "NVIDIA News",
      "title": "Marine Biological Laboratory Explores Human Memory With AI and Virtual Reality",
      "url": "https://blogs.nvidia.com/blog/mbl-human-memory-ai-vr-rtx/",
      "date": "2025-12-22",
      "summary": "The works of Plato state that when humans have an experience, some level of change occurs in their brain, which is powered by memory — specifically long-term memory. This change is what Andre Fenton, professor of neural science at New York University, and Abhishek Kumar, assistant professor of cell and regenerative biology at the University",
      "author": "Zoe Kessler",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2026-01-08 01:03:25"
    }
  ]
}