{
  "source": "NVIDIA Blog",
  "total_articles": 18,
  "updated_at": "2026-01-22 01:05:08",
  "articles": [
    {
      "source": "NVIDIA Blog",
      "title": "‘Largest Infrastructure Buildout in Human History’: Jensen Huang on AI’s ‘Five-Layer Cake’ at Davos",
      "url": "https://blogs.nvidia.com/blog/davos-wef-blackrock-ceo-larry-fink-jensen-huang/",
      "date": "2026-01-21",
      "summary": "AI is becoming the foundation of the “largest infrastructure buildout in human history,” spanning energy and computing infrastructure, AI models and applications, NVIDIA founder and CEO Jensen Huang said during a World Economic Forum discussion with BlackRock CEO Larry Fink.",
      "author": "Brian Caulfield",
      "categories": [
        "Corporate",
        "Artificial Intelligence"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Survive the Quarantine Zone and More With Devolver Digital Games on GeForce NOW",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-quarantine-zone/",
      "date": "2026-01-15",
      "summary": "NVIDIA kicked off the year at CES, where the crowd buzzed about the latest gaming announcements — including the native GeForce NOW app for Linux and Amazon Fire TV sticks, community-requested flight-control support and a stacked AAA lineup for the year. Check out what the creators of the YouTube channels Cloud Gaming Battle and Anytime",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "CEOs of NVIDIA and Lilly Share ‘Blueprint for What Is Possible’ in AI and Drug Discovery",
      "url": "https://blogs.nvidia.com/blog/jpmorgan-healthcare-nvidia-lilly/",
      "date": "2026-01-13",
      "summary": "NVIDIA and Lilly are putting together “a blueprint for what is possible in the future of drug discovery,” NVIDIA founder and CEO Jensen Huang told attendees at a fireside chat Monday with Dave Ricks, chair and CEO of Lilly. The conversation — which took place during the annual J.P. Morgan Healthcare Conference in San Francisco",
      "author": "Isha Salian",
      "categories": [
        "Corporate",
        "Generative AI",
        "Artificial Intelligence",
        "Healthcare and Life Sciences",
        "Social Impact"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "AI’s Next Revolution: Multiply Labs Is Scaling Robotics-Driven Cell Therapy Biomanufacturing Labs",
      "url": "https://blogs.nvidia.com/blog/multiply-labs-isaac-omniverse/",
      "date": "2026-01-12",
      "summary": "Startup works with leading cell therapy companies to bring robotics manufacturing into the clean room, reducing costs by more than 70% while accelerating output compared with legacy systems.",
      "author": "Scott Martin",
      "categories": [
        "Robotics",
        "Healthcare and Life Sciences",
        "NVIDIA Isaac Sim",
        "Omniverse Enterprise",
        "Social Impact"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA Unveils Multi-Agent Intelligent Warehouse and Catalog Enrichment AI Blueprints to Power the Retail Pipeline",
      "url": "https://blogs.nvidia.com/blog/multi-agent-intelligent-warehouse-and-catalog-enrichment-blueprints/",
      "date": "2026-01-09",
      "summary": "Every “that was easy” shopping moment is made possible by teams working to hit shipping deadlines, scrambling to fix missing product details and striving to provide curated shopping experiences. Behind the scenes, workers are dealing with the reality of aging systems, siloed data and rising customer expectations — a combination that makes consistency and speed",
      "author": "Cynthia Countouris",
      "categories": [
        "Generative AI",
        "Agentic AI",
        "Nemotron",
        "NVIDIA Blueprints",
        "Open Source",
        "Retail"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "AI Copilot Keeps Berkeley’s X-Ray Particle Accelerator on Track",
      "url": "https://blogs.nvidia.com/blog/ai-copilot-berkeley-x-ray-particle-accelerator/",
      "date": "2026-01-08",
      "summary": "In the rolling hills of Berkeley, California, an AI agent is supporting high-stakes physics experiments at the Advanced Light Source (ALS) particle accelerator. Researchers at the Lawrence Berkeley National Laboratory ALS facility recently deployed the Accelerator Assistant, a large language model (LLM)-driven system to keep X-ray research on track. The Accelerator Assistant — powered by",
      "author": "Scott Martin",
      "categories": [
        "Generative AI",
        "GPU Computing"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Japan Science and Technology Agency Develops NVIDIA-Powered Moonshot Robot for Elderly Care",
      "url": "https://blogs.nvidia.com/blog/japan-science-technology-agency-develops-moonshot-robot/",
      "date": "2026-01-08",
      "summary": "The next universal technology since the smartphone is on the horizon — and it may be a little less pocket friendly. The Moonshot research program, funded by the Japan Science and Technology Agency and accelerated by NVIDIA AI and robotics technologies, is working to create a world by 2050 where AI-powered, autonomously learning robots are",
      "author": "Zoe Kessler",
      "categories": [
        "Research",
        "Robotics",
        "GPU",
        "NVIDIA Isaac Sim",
        "NVIDIA Jetson",
        "NVIDIA RTX"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "More Ways to Play, More Games to Love — GeForce NOW Wraps CES With Linux Support, Fire TV App, Flight Stick Controls",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-ces-2026-recap/",
      "date": "2026-01-08",
      "summary": "NVIDIA is wrapping up a big week at the CES trade show with a set of GeForce NOW announcements that are bringing more ways to play and more games to the cloud. From new native apps for Linux and Amazon Fire TV streaming sticks to hands-on throttle-and-stick (HOTAS) support for simulation fans and a new",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Steel, Sensors and Silicon: How Caterpillar Is Bringing Edge AI to the Jobsite",
      "url": "https://blogs.nvidia.com/blog/caterpillar-ces-2026/",
      "date": "2026-01-07",
      "summary": "At CES, Caterpillar reveals how it’s integrating NVIDIA technologies, from NVIDIA Jetson Thor to speech models, to transform the world’s heavy industries.",
      "author": "Madison Huang",
      "categories": [
        "Driving",
        "Robotics"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "From Warehouse to Wallet: New State of AI in Retail and CPG Survey Uncovers How AI Is Rewiring Supply Chains and Customer Experiences",
      "url": "https://blogs.nvidia.com/blog/ai-in-retail-cpg-survey-2026/",
      "date": "2026-01-07",
      "summary": "AI has transformed retail and consumer packaged goods (CPG) operations, enhancing customer analysis and segmentation to enable greater personalization for marketing and advertising, and boosting the speed and accuracy of demand forecasting for supply chains and logistics. Companies are also raising the bar for customer engagement through intelligent digital shopping assistants and catalog enrichment by",
      "author": "Cynthia Countouris",
      "categories": [
        "Generative AI",
        "Robotics",
        "Agentic AI",
        "Artificial Intelligence",
        "Open Source",
        "Physical AI",
        "Retail"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA Brings GeForce RTX Gaming to More Devices With New GeForce NOW Apps for Linux PC and Amazon Fire TV",
      "url": "https://blogs.nvidia.com/blog/geforce-now-ces-2026/",
      "date": "2026-01-06",
      "summary": "Announced at the CES trade show running this week in Las Vegas, NVIDIA is bringing more devices, more games and more ways to play to its GeForce NOW cloud gaming service. Powered by GeForce RTX 5080-class performance on the NVIDIA Blackwell RTX platform, GeForce NOW Ultimate continues to raise the bar for PC gamers streaming",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "CES 2026",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA RTX Accelerates 4K AI Video Generation on PC With LTX-2 and ComfyUI Upgrades",
      "url": "https://blogs.nvidia.com/blog/rtx-ai-garage-ces-2026-open-models-video-generation/",
      "date": "2026-01-06",
      "summary": "2025 marked a breakout year for AI development on PC. PC-class small language models (SLMs) improved accuracy by nearly 2x over 2024, dramatically closing the gap with frontier cloud-based large language models (LLMs). AI PC developer tools including Ollama, ComfyUI, llama.cpp and Unsloth have matured, their popularity has doubled year over year and the number",
      "author": "Gerardo Delgado",
      "categories": [
        "Generative AI",
        "Artificial Intelligence",
        "CES 2026",
        "Creators",
        "GeForce RTX",
        "NVIDIA RTX",
        "Rendering",
        "RTX AI Garage"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA DLSS 4.5, Path Tracing and G-SYNC Pulsar Supercharge Gameplay With Enhanced Performance and Visuals",
      "url": "https://blogs.nvidia.com/blog/dlss-path-tracing-g-sync-pulsar-ces-2026/",
      "date": "2026-01-06",
      "summary": "At the CES trade show, NVIDIA today announced DLSS 4.5, which introduces Dynamic Multi Frame Generation, a new 6X Multi Frame Generation mode and a second-generation transformer model for DLSS Super Resolution, so gamers can experience the latest and greatest titles with enhanced performance and visuals. Over 250 games and apps now support NVIDIA DLSS",
      "author": "Jason Paul",
      "categories": [
        "Gaming",
        "Artificial Intelligence",
        "CES 2026",
        "Cloud Gaming",
        "G-SYNC",
        "Game Development",
        "GeForce",
        "GeForce NOW"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA Rubin Platform, Open Models, Autonomous Driving: NVIDIA Presents Blueprint for the Future at CES",
      "url": "https://blogs.nvidia.com/blog/2026-ces-special-presentation/",
      "date": "2026-01-05",
      "summary": "NVIDIA founder and CEO Jensen Huang took the stage at the Fontainebleau Las Vegas to open CES 2026, declaring that AI is scaling into every domain and every device. “Computing has been fundamentally reshaped as a result of accelerated computing, as a result of artificial intelligence,” Huang said. “What that means is some $10 trillion",
      "author": "Brian Caulfield",
      "categories": [
        "Corporate",
        "Deep Learning",
        "Driving",
        "Hardware",
        "Supercomputing",
        "CES 2026"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA BlueField-Powered Cybersecurity and Acceleration Arrive on NVIDIA Enterprise AI Factory Validated Design",
      "url": "https://blogs.nvidia.com/blog/bluefield-cybersecurity-acceleration-enterprise-ai-factory-validated-design/",
      "date": "2026-01-05",
      "summary": "AI is powering breakthroughs across industries, helping enterprises operate with greater intelligence and speed. As AI factories scale, the next generation of enterprise AI depends on infrastructure that can efficiently manage data, secure every stage of the pipeline and accelerate the core services that move, protect and process information alongside AI workloads. NVIDIA has expanded",
      "author": "Itay Ozery",
      "categories": [
        "Data Center",
        "Networking",
        "Artificial Intelligence",
        "CES 2026",
        "Cybersecurity",
        "NVIDIA BlueField"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA DGX SuperPOD Sets the Stage for Rubin-Based Systems",
      "url": "https://blogs.nvidia.com/blog/dgx-superpod-rubin/",
      "date": "2026-01-05",
      "summary": "NVIDIA DGX SuperPOD is paving the way for large-scale system deployments built on the NVIDIA Rubin platform — the next leap forward in AI computing. At the CES trade show in Las Vegas, NVIDIA today introduced the Rubin platform, comprising six new chips designed to deliver one incredible AI supercomputer, and engineered to accelerate agentic",
      "author": "Charlie Boyle",
      "categories": [
        "Data Center",
        "CES 2026",
        "NVIDIA BlueField",
        "NVIDIA DGX",
        "NVIDIA Rubin"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA DGX Spark and DGX Station Power the Latest Open-Source and Frontier Models From the Desktop",
      "url": "https://blogs.nvidia.com/blog/dgx-spark-and-station-open-source-frontier-models/",
      "date": "2026-01-05",
      "summary": "Open-source AI is accelerating innovation across industries, and NVIDIA DGX Spark and DGX Station are built to help developers turn innovation into impact. NVIDIA today unveiled at the CES trade show how the DGX Spark and DGX Station deskside AI supercomputers let developers harness the latest open and frontier AI models on a local deskside",
      "author": "Chris Marriott",
      "categories": [
        "Data Center",
        "Artificial Intelligence",
        "CES 2026",
        "CUDA-X",
        "Hardware",
        "Nemotron",
        "NVIDIA AI Enterprise",
        "NVIDIA DGX",
        "NVIDIA RTX",
        "Open Source"
      ],
      "collected_at": "2026-01-22 01:04:28"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA Expands Global DRIVE Hyperion Ecosystem to Accelerate the Road to Full Autonomy",
      "url": "https://blogs.nvidia.com/blog/global-drive-hyperion-ecosystem-full-autonomy/",
      "date": "2026-01-05",
      "summary": "At the CES trade show running this week in Las Vegas, NVIDIA announced that the global DRIVE Hyperion ecosystem is expanding to include tier 1 suppliers, automotive integrators and sensor partners, including Aeva, AUMOVIO, Astemo, Arbe, Bosch, Hesai, Magna, Omnivision, Quanta, Sony and ZF Group. This builds on collaborations unveiled at NVIDIA GTC Washington, D.C.,",
      "author": "Mo Poorsartep",
      "categories": [
        "Driving",
        "Artificial Intelligence",
        "CES 2026",
        "NVIDIA DRIVE",
        "Transportation"
      ],
      "collected_at": "2026-01-22 01:04:28"
    }
  ]
}