{
  "source": "NVIDIA Blog",
  "total_articles": 18,
  "updated_at": "2025-12-15 01:04:04",
  "articles": [
    {
      "source": "NVIDIA Blog",
      "title": "Cheers to AI: ADAM Robot Bartender Makes Drinks at Vegas Golden Knights Game",
      "url": "https://blogs.nvidia.com/blog/adam-robot-vegas-golden-knights-thor/",
      "date": "2025-12-12",
      "summary": "In Las Vegas’s T-Mobile Arena, fans of the Golden Knights are getting more than just hockey — they’re getting a taste of the future. ADAM, a robot developed with NVIDIA Isaac libraries, is pouring drinks and turning heads in one of the NHL’s most exciting venues. ADAM, short for Automated Dual Arm Mixologist, was developed",
      "author": "Scott Martin",
      "categories": [
        "Corporate",
        "Robotics",
        "NVIDIA Isaac Sim",
        "NVIDIA Jetson",
        "NVIDIA Omniverse",
        "TensorRT"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "As AI Grows More Complex, Model Builders Rely on NVIDIA",
      "url": "https://blogs.nvidia.com/blog/leading-models-nvidia/",
      "date": "2025-12-11",
      "summary": "Unveiling what it describes as the most capable model series yet for professional knowledge work, OpenAI launched GPT-5.2 today. The model was trained and deployed on NVIDIA infrastructure, including NVIDIA Hopper and GB200 NVL72 systems. It’s the latest example of how leading AI builders train and deploy at scale on NVIDIA’s full-stack AI infrastructure. Pretraining:",
      "author": "Ashraf Eassa",
      "categories": [
        "Cloud",
        "Corporate",
        "Deep Learning"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Ride Into Adventure With Capcom’s ‘Monster Hunter Stories’ Series in the Cloud",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-monster-hunter-stories/",
      "date": "2025-12-11",
      "summary": "Hunters, saddle up — adventure awaits in the cloud. Journey into the world of Monster Hunter Stories as Capcom’s acclaimed role-playing classics join GeForce NOW. Monster Hunter Stories and Monster Hunter Stories 2: Wings of Ruin are soaring into the cloud this week, bringing colorful worlds, charming companions and turn-based monster battles across devices. They",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Opt-In NVIDIA Software Enables Data Center Fleet Management",
      "url": "https://blogs.nvidia.com/blog/optional-data-center-fleet-management-software/",
      "date": "2025-12-10",
      "summary": "As the scale and complexity of AI infrastructure grows, data center operators need continuous visibility into factors including performance, temperature and power usage. These insights enable data center operators to actively monitor and adjust data center configurations across large-scale, distributed systems — validating that these systems are operating at their highest efficiency and reliability. NVIDIA",
      "author": "NVIDIA Newsroom",
      "categories": [
        "Corporate",
        "Software",
        "Cybersecurity"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "How NVIDIA H100 GPUs on CoreWeave’s AI Cloud Platform Delivered a Record-Breaking Graph500 Run",
      "url": "https://blogs.nvidia.com/blog/h100-coreweave-graph500/",
      "date": "2025-12-10",
      "summary": "The world’s top-performing system for graph processing at scale was built on a commercially available cluster. NVIDIA last month announced a record-breaking benchmark result of 410 trillion traversed edges per second (TEPS), ranking No. 1 on the 31st Graph500 breadth-first search (BFS) list. Performed on an accelerated computing cluster hosted in a CoreWeave data center",
      "author": "Prachi Goel",
      "categories": [
        "Data Center",
        "Networking",
        "Cloud Services",
        "CUDA",
        "Hardware",
        "NVIDIA Hopper Architecture",
        "Supercomputing"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "3 Ways NVIDIA Is Powering the Industrial Revolution",
      "url": "https://blogs.nvidia.com/blog/gpu-cuda-scaling-laws-industrial-revolution/",
      "date": "2025-12-10",
      "summary": "The NVIDIA accelerated computing platform is leading supercomputing benchmarks once dominated by CPUs, enabling AI, science, business and computing efficiency worldwide. Moore’s Law has run its course, and parallel processing is the way forward. With this evolution, NVIDIA GPU platforms are now uniquely positioned to deliver on the three scaling laws — pretraining, post-training and",
      "author": "Dion Harris",
      "categories": [
        "Corporate",
        "CUDA",
        "CUDA-X",
        "NVIDIA GPU",
        "Physical AI",
        "SC25"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA Awards up to $60,000 Research Fellowships to PhD Students",
      "url": "https://blogs.nvidia.com/blog/graduate-fellowship-recipients-2026-2027/",
      "date": "2025-12-04",
      "summary": "For 25 years, the NVIDIA Graduate Fellowship Program has supported graduate students doing outstanding work relevant to NVIDIA technologies. Today, the program announced the latest awards of up to $60,000 each to 10 Ph.D. students involved in research that spans all areas of computing innovation. Selected from a highly competitive applicant pool, the awardees will",
      "author": "Sylvia Chanak",
      "categories": [
        "Generative AI",
        "Research",
        "Artificial Intelligence",
        "Education"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Robots’ Holiday Wishes Come True: NVIDIA Jetson Platform Offers High-Performance Edge AI at Festive Prices",
      "url": "https://blogs.nvidia.com/blog/jetson-edge-ai-holiday-2025/",
      "date": "2025-12-04",
      "summary": "Developers, researchers, hobbyists and students can take a byte out of holiday shopping this season as NVIDIA has unwrapped special discounts on the NVIDIA Jetson family of developer kits for edge AI and robotics — available through Sunday, Jan. 11. Whether tapping into the breakthrough capabilities of Jetson AGX Thor, the versatility of Jetson AGX",
      "author": "Chen Su",
      "categories": [
        "Robotics",
        "Artificial Intelligence",
        "Creators",
        "Embedded Computing",
        "Hardware",
        "Industrial and Manufacturing",
        "Inference",
        "Isaac",
        "Jetson",
        "Physical AI",
        "Simulation and Design",
        "Synthetic Data Generation"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Game the Halls: GeForce NOW Brings Holiday Cheer With 30 New Games in the Cloud",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-dec-2025/",
      "date": "2025-12-04",
      "summary": "Editor’s note: The Game Pass edition of ‘Hogwarts Legacy’ will also be supported on GeForce NOW when the Steam and Epic Games Store versions launch on the service later this month. GeForce NOW is decking the digital halls with 30 new games to keep spirits high all month long. Join the fun with Hogwarts Legacy,",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Mixture of Experts Powers the Most Intelligent Frontier AI Models, Runs 10x Faster to Deliver 1/10 the Token Cost on NVIDIA Blackwell NVL72",
      "url": "https://blogs.nvidia.com/blog/mixture-of-experts-frontier-models/",
      "date": "2025-12-03",
      "summary": "The top 10 most intelligent open-source models all use a mixture-of-experts architecture. Kimi K2 Thinking, DeepSeek-R1, Mistral Large 3 and others run 10x faster to enable one-tenth the cost per token on NVIDIA GB200 NVL72. A look under the hood of virtually any frontier model today will reveal a mixture-of-experts (MoE) model architecture that mimics",
      "author": "Shruti Koparkar",
      "categories": [
        "Data Center",
        "Artificial Intelligence",
        "Dynamo",
        "Inference",
        "NVIDIA Blackwell",
        "NVLink",
        "Open Source",
        "Think SMART"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA Partners With Mistral AI to Accelerate New Family of Open Models",
      "url": "https://blogs.nvidia.com/blog/mistral-frontier-open-models/",
      "date": "2025-12-02",
      "summary": "Today, Mistral AI announced the Mistral 3 family of open-source multilingual, multimodal models, optimized across NVIDIA supercomputing and edge platforms. Mistral Large 3 is a mixture-of-experts (MoE) model — instead of firing up every neuron for every token, it only activates the parts of the model with the most impact. The result is efficiency",
      "author": "Kari Briski",
      "categories": [
        "Data Center",
        "Inference",
        "NVL72",
        "NVLink",
        "TensorRT"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA and AWS Expand Full-Stack Partnership, Providing the Secure, High-Performance Compute Platform Vital for Future Innovation",
      "url": "https://blogs.nvidia.com/blog/aws-partnership-expansion-reinvent/",
      "date": "2025-12-02",
      "summary": "At AWS re:Invent, NVIDIA and Amazon Web Services expanded their strategic collaboration with new technology integrations across interconnect technology, cloud infrastructure, open models and physical AI. As part of this expansion, AWS will support NVIDIA NVLink Fusion — a platform for custom AI infrastructure — for deploying its custom-designed silicon, including next-generation Trainium4 chips for",
      "author": "Ian Buck",
      "categories": [
        "Cloud",
        "Data Center",
        "Generative AI",
        "Hardware",
        "Networking",
        "Robotics",
        "Software",
        "Cosmos",
        "Events",
        "Isaac",
        "Nemotron",
        "NVIDIA Blackwell",
        "NVIDIA NIM",
        "NVIDIA Spectrum-X",
        "NVLink",
        "Open Source",
        "Physical AI",
        "Riva"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "At NeurIPS, NVIDIA Advances Open Model Development for Digital and Physical AI",
      "url": "https://blogs.nvidia.com/blog/neurips-open-source-digital-physical-ai/",
      "date": "2025-12-01",
      "summary": "Researchers worldwide rely on open-source technologies as the foundation of their work. To equip the community with the latest advancements in digital and physical AI, NVIDIA is further expanding its collection of open AI models, datasets and tools — with potential applications in virtually every research field. At NeurIPS, one of the world’s top AI",
      "author": "Bryan Catanzaro",
      "categories": [
        "Corporate",
        "Driving",
        "Generative AI",
        "Research",
        "Robotics",
        "Software",
        "Agentic AI",
        "Artificial Intelligence",
        "Cosmos",
        "NVIDIA Research",
        "Open Source",
        "Physical AI",
        "Synthetic Data Generation",
        "Transportation"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "The Ultimate Black Friday Deal Is Here",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-black-friday-2025/",
      "date": "2025-11-27",
      "summary": "Black Friday is leveling up. Get ready to score one of the biggest deals of the season — 50% off the first three months of a new GeForce NOW Ultimate membership. That’s GeForce RTX 5080-class power in the cloud for half the price. The NVIDIA Blackwell RTX upgrade is now fully live across all servers",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "From Government to Gaming, AI Is ‘Strengthening Korea’s Digital Foundation,’ NVIDIA Leader Says at AI Day Seoul",
      "url": "https://blogs.nvidia.com/blog/ai-day-seoul/",
      "date": "2025-11-26",
      "summary": "Last week, more than 1,000 attendees joined NVIDIA AI Day Seoul to learn about sovereign AI — including breakout sessions on agentic and physical AI, hands-on workshops and a startup reception for members of the NVIDIA Inception program, all offering insights into the current and future landscape of the AI ecosystem in Korea.",
      "author": "Solee Moon",
      "categories": [
        "Generative AI",
        "AI Days",
        "Artificial Intelligence",
        "Cloud Services",
        "Deep Learning Institute",
        "Economic Development",
        "Events",
        "Inception",
        "Social Impact",
        "Sovereign AI"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "FLUX.2 Image Generation Models Now Released, Optimized for NVIDIA RTX GPUs",
      "url": "https://blogs.nvidia.com/blog/rtx-ai-garage-flux-2-comfyui/",
      "date": "2025-11-25",
      "summary": "Black Forest Labs — the frontier AI research lab developing visual generative AI models — today released the FLUX.2 family of state-of-the-art image generation models. FLUX.2 is packed with new tools and capabilities, including a multi-reference feature that can generate dozens of similar image variations, in photorealistic detail and with cleaner fonts — even at",
      "author": "Michael Fukuyama",
      "categories": [
        "Generative AI",
        "Artificial Intelligence",
        "Conversational AI",
        "Creators",
        "GeForce",
        "NVIDIA RTX",
        "Rendering",
        "RTX AI Garage"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "AI On: 3 Ways Specialized AI Agents Are Reshaping Businesses",
      "url": "https://blogs.nvidia.com/blog/specialized-ai-agents/",
      "date": "2025-11-24",
      "summary": "Built on open-source models, today’s AI agents can be tailored for unique workflows and business needs to boost productivity and return on investment.",
      "author": "Amanda Saunders",
      "categories": [
        "Data Center",
        "Generative AI",
        "Agentic AI",
        "AI On",
        "Artificial Intelligence",
        "Cybersecurity",
        "Financial Services",
        "Industrial and Manufacturing",
        "Nemotron",
        "NVIDIA Blueprints",
        "NVIDIA NeMo",
        "Simulation and Design"
      ],
      "collected_at": "2025-12-15 01:03:34"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Gordon Bell Prize Winners Push Open Science Boundaries With NVIDIA-Powered Supercomputers",
      "url": "https://blogs.nvidia.com/blog/gordon-bell-finalists-2025/",
      "date": "2025-11-20",
      "summary": "Five finalists for the esteemed high-performance computing award have achieved breakthroughs in climate modeling, fluid simulation and more with the Alps, JUPITER and Perlmutter supercomputers — with two winners taking home the prize.",
      "author": "Dion Harris",
      "categories": [
        "Research",
        "Supercomputing",
        "Aerospace",
        "Artificial Intelligence",
        "Climate",
        "CUDA",
        "Digital Twin",
        "High-Performance Computing",
        "Open Source",
        "Parallel Computing",
        "SC25",
        "Science",
        "Scientific Visualization",
        "Simulation and Design",
        "Social Impact"
      ],
      "collected_at": "2025-12-15 01:03:34"
    }
  ]
}