{
  "source": "NVIDIA News",
  "total_articles": 3,
  "updated_at": "2025-12-28 07:07:07",
  "articles": [
    {
      "source": "NVIDIA News",
      "title": "Make Spirits Bright With Holiday Hits on GeForce NOW",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-holiday-2025/",
      "date": "2025-12-25",
      "summary": "Holiday lights are twinkling, hot cocoa’s on the stove and gamers are settling in for a well-earned break. Whether staying in or heading on a winter getaway, GeForce NOW makes it easy to keep gaming from anywhere. Stream the 13 new games joining GeForce NOW this week across devices — including laptops, tablets and mobile",
      "author": "GeForce NOW Community",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2025-12-28 07:06:32"
    },
    {
      "source": "NVIDIA News",
      "title": "Marine Biological Laboratory Explores Human Memory With AI and Virtual Reality",
      "url": "https://blogs.nvidia.com/blog/mbl-human-memory-ai-vr-rtx/",
      "date": "2025-12-22",
      "summary": "The works of Plato state that when humans have an experience, some level of change occurs in their brain, which is powered by memory — specifically long-term memory. This change is what Andre Fenton, professor of neural science at New York University, and Abhishek Kumar, assistant professor of cell and regenerative biology at the University",
      "author": "Zoe Kessler",
      "categories": [
        "Blogs"
      ],
      "collected_at": "2025-12-28 07:06:32"
    },
    {
      "source": "NVIDIA News",
      "title": "NVIDIA Debuts Nemotron 3 Family of Open Models",
      "url": "https://nvidianews.nvidia.com/news/nvidia-debuts-nemotron-3-family-of-open-models",
      "date": "2025-12-15",
      "summary": "The Nemotron 3 family of open models — in Nano, Super and Ultra sizes — introduces the most efficient family of open models with leading accuracy for building agentic AI applications.",
      "author": "",
      "categories": [
        "Press Releases"
      ],
      "collected_at": "2025-12-28 07:06:32"
    }
  ]
}