{
  "source": "NVIDIA Blog",
  "total_articles": 18,
  "updated_at": "2026-02-24 01:16:13",
  "articles": [
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA Brings AI-Powered Cybersecurity to World’s Critical Infrastructure",
      "url": "https://blogs.nvidia.com/blog/ai-cybersecurity-operational-technology-industrial-control-systems/",
      "date": "2026-02-23",
      "summary": "As technologies and systems become more digitalized and connected across the world, operational technology (OT) environments and industrial control systems (ICS) — from energy and manufacturing to transportation and utilities — are increasingly depending on enterprise networks and the cloud. This expands OT and ICS capabilities — but also their exposure to cyber threats. Unlike",
      "author": "Itay Ozery",
      "categories": [
        "Data Center",
        "Cybersecurity",
        "NVIDIA BlueField"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Survey Reveals AI Advances in Telecom: Networks and Automation in Driver’s Seat as Return on Investment Climbs",
      "url": "https://blogs.nvidia.com/blog/ai-in-telco-survey-2026/",
      "date": "2026-02-19",
      "summary": "AI is accelerating the telecommunications industry’s transformation, becoming the backbone of autonomous networks and AI-native wireless infrastructure. At the same time, the technology is unlocking new business and revenue opportunities, as telecom operators accelerate AI adoption across consumers, enterprises and nations. NVIDIA’s fourth annual “State of AI in Telecommunications” survey report unpacks these trends, underscoring",
      "author": "Kanika Atri",
      "categories": [
        "Generative AI",
        "6G",
        "Agentic AI",
        "Artificial Intelligence",
        "Telecommunications"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "All About the Games: Play Over 4,500 Titles With GeForce NOW",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-battlefield-season-2/",
      "date": "2026-02-19",
      "summary": "The GeForce NOW anniversary celebration keeps on rolling, and this week is all about the games that make it possible. With more than 4,500 titles supported in the cloud — plus 12 new games this week — there’s always something new to stream, share and discover. The #6YearsofGFN fun continues with a community giveaway hosted",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "India Fuels Its AI Mission With NVIDIA",
      "url": "https://blogs.nvidia.com/blog/india-ai-mission-infrastructure-models/",
      "date": "2026-02-18",
      "summary": "From AI infrastructure leaders to frontier model developers, India is teaming with NVIDIA to drive AI transformation across the nation.",
      "author": "Jay Puri",
      "categories": [
        "Data Center",
        "Generative AI",
        "Artificial Intelligence",
        "Economic Development",
        "Education",
        "Inception",
        "Nemotron",
        "NVIDIA Blackwell",
        "Open Source",
        "Public Sector",
        "Sovereign AI"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "India’s Global Systems Integrators Build Next Wave of Enterprise Agents With NVIDIA AI, Transforming Back Office and Customer Support",
      "url": "https://blogs.nvidia.com/blog/india-enterprise-ai-agents/",
      "date": "2026-02-18",
      "summary": "Agentic AI is reshaping India’s tech industry, delivering leaps in services worldwide. Tapping into NVIDIA AI Enterprise software and NVIDIA Nemotron models, India’s technology leaders are accelerating productivity and efficiency across industries — from call centers to telecommunications and healthcare. Infosys, Persistent, Tech Mahindra and Wipro are leading the way for business transformation, improving back-office",
      "author": "John Fanelli",
      "categories": [
        "Generative AI",
        "Nemotron",
        "NVIDIA AI Enterprise",
        "NVIDIA NeMo",
        "NVIDIA NIM"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA and Global Industrial Software Leaders Partner With India’s Largest Manufacturers to Drive AI Boom",
      "url": "https://blogs.nvidia.com/blog/india-global-industrial-software-leaders-manufacturers-ai/",
      "date": "2026-02-18",
      "summary": "India is entering a new age of industrialization, as AI transforms how the world designs, builds and runs physical products and systems. The country is investing $134 billion dollars in new manufacturing capacity across construction, automotive, renewable energy and robotics, creating both a massive challenge and opportunity to build software-defined factories from day one. At",
      "author": "Timothy Costa",
      "categories": [
        "Robotics",
        "Cosmos",
        "CUDA-X",
        "Industrial and Manufacturing",
        "Isaac",
        "NVIDIA Blueprints",
        "Omniverse"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "New SemiAnalysis InferenceX Data Shows NVIDIA Blackwell Ultra Delivers up to 50x Better Performance and 35x Lower Costs for Agentic AI",
      "url": "https://blogs.nvidia.com/blog/data-blackwell-ultra-performance-lower-cost-agentic-ai/",
      "date": "2026-02-16",
      "summary": "The NVIDIA Blackwell platform has been widely adopted by leading inference providers such as Baseten, DeepInfra, Fireworks AI and Together AI to reduce cost per token by up to 10x. Now, the NVIDIA Blackwell Ultra platform is taking this momentum further for agentic AI. AI agents and coding assistants are driving explosive growth in software-programming-related",
      "author": "Ashraf Eassa",
      "categories": [
        "Cloud",
        "Data Center",
        "Hardware",
        "Networking",
        "Software",
        "Agentic AI",
        "Dynamo",
        "Inference",
        "NVIDIA Blackwell",
        "NVIDIA Rubin",
        "NVLink",
        "TensorRT",
        "Think SMART"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Code, Compute and Connection: Inside the Inaugural NVIDIA AI Day São Paulo",
      "url": "https://blogs.nvidia.com/blog/ai-day-sao-paulo/",
      "date": "2026-02-12",
      "summary": "The worldwide tour of NVIDIA AI Days — bringing together AI enthusiasts, developers, researchers and startups — made its latest stop in São Paulo, Brazil.",
      "author": "Angie Lee",
      "categories": [
        "Generative AI",
        "AI Days",
        "Artificial Intelligence",
        "Deep Learning Institute",
        "Economic Development",
        "Events",
        "Inception",
        "Social Impact",
        "Sovereign AI"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Leading Inference Providers Cut AI Costs by up to 10x With Open Source Models on NVIDIA Blackwell",
      "url": "https://blogs.nvidia.com/blog/inference-open-source-models-blackwell-reduce-cost-per-token/",
      "date": "2026-02-12",
      "summary": "A diagnostic insight in healthcare. A character’s dialogue in an interactive game. An autonomous resolution from a customer service agent. Each of these AI-powered interactions is built on the same unit of intelligence: a token. Scaling these AI interactions requires businesses to consider whether they can afford more tokens. The answer lies in better tokenomics",
      "author": "Shruti Koparkar",
      "categories": [
        "Data Center",
        "Generative AI",
        "Agentic AI",
        "Dynamo",
        "Inference",
        "NVIDIA Blackwell",
        "Open Source",
        "TensorRT",
        "Think SMART"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "NVIDIA DGX Spark Powers Big Projects in Higher Education",
      "url": "https://blogs.nvidia.com/blog/dgx-spark-higher-education/",
      "date": "2026-02-12",
      "summary": "At leading institutions across the globe, the NVIDIA DGX Spark desktop supercomputer is bringing data‑center‑class AI to lab benches, faculty offices and students’ systems. There’s even a DGX Spark hard at work in the South Pole, at the IceCube Neutrino Observatory run by the University of Wisconsin-Madison. The compact supercomputer’s petaflop‑class performance enables local deployment",
      "author": "Max Starubinskiy",
      "categories": [
        "Data Center",
        "Generative AI",
        "Hardware",
        "Artificial Intelligence",
        "Education",
        "NVIDIA DGX"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "GeForce NOW Turns Screens Into a Gaming Machine",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-amazon-fire-tv-app/",
      "date": "2026-02-12",
      "summary": "The GeForce NOW sixth-anniversary festivities roll on this February, continuing a monthlong celebration of NVIDIA’s cloud gaming service. This week brings even more reasons to join the party, as GeForce NOW launches on a new platform with support for Amazon Fire TV devices, and eight new games to keep the streaming going strong. The new",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "GeForce NOW Celebrates Six Years of Streaming With 24 Games in February",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-feb-2026-games-list/",
      "date": "2026-02-05",
      "summary": "Break out the cake and green sprinkles — GeForce NOW is turning six. Since launch, members have streamed over 1 billion hours, and the party’s just getting started. Throughout February, members can look forward to new games, fresh ways to play across more devices and even more ways to bring RTX power to every screen",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Nemotron Labs: How AI Agents Are Turning Documents Into Real-Time Business Intelligence",
      "url": "https://blogs.nvidia.com/blog/ai-agents-intelligent-document-processing/",
      "date": "2026-02-04",
      "summary": "Businesses today face the challenge of uncovering valuable insights buried within a wide variety of documents — including reports, presentations, PDFs, web pages and spreadsheets.",
      "author": "Moon Chung",
      "categories": [
        "Generative AI",
        "Agentic AI",
        "Artificial Intelligence",
        "Customer Stories",
        "Financial Services",
        "Nemotron",
        "Nemotron Labs",
        "Open Source"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Everything Will Be Represented in a Virtual Twin, NVIDIA CEO Jensen Huang Says at 3DEXPERIENCE World",
      "url": "https://blogs.nvidia.com/blog/huang-3dexperience-2026/",
      "date": "2026-02-03",
      "summary": "NVIDIA founder and CEO Jensen Huang and Dassault Systèmes CEO Pascal Daloz announced a partnership to build a shared industrial AI architecture, merging virtual twins with physics-based AI to redefine the future of design, engineering and manufacturing.",
      "author": "Brian Caulfield",
      "categories": [
        "Corporate",
        "Pro Graphics",
        "Software",
        "Agentic AI",
        "AI Factory",
        "Artificial Intelligence",
        "CUDA",
        "Digital Twin",
        "Nemotron",
        "NVIDIA NeMo",
        "Omniverse",
        "Physical AI",
        "Simulation and Design"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Mercedes-Benz Unveils New S-Class Built on NVIDIA DRIVE AV, Which Enables an L4-Ready Architecture",
      "url": "https://blogs.nvidia.com/blog/mercedes-benz-l4-s-class-drive-av-platform/",
      "date": "2026-01-29",
      "summary": "Mercedes-Benz is marking 140 years of automotive innovation with a new S-Class built for the AI era, bringing together automotive safety and NVIDIA’s advanced autonomous driving platform to enable a level 4-ready architecture designed for trust. The new S-Class with MB.OS, which will be equipped with the NVIDIA DRIVE Hyperion architecture and full-stack NVIDIA DRIVE",
      "author": "Jessica Soares",
      "categories": [
        "Driving",
        "NVIDIA DRIVE"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Into the Omniverse: Physical AI Open Models and Frameworks Advance Robots and Autonomous Systems",
      "url": "https://blogs.nvidia.com/blog/physical-ai-open-models-robot-autonomous-systems-omniverse/",
      "date": "2026-01-29",
      "summary": "Open source has become essential for driving innovation in robotics and autonomy. By providing access to critical infrastructure — from simulation frameworks to AI models — NVIDIA is enabling collaborative development that accelerates the path to safer, more capable autonomous systems.",
      "author": "Akhil Docca",
      "categories": [
        "Pro Graphics",
        "Robotics",
        "Artificial Intelligence",
        "Cosmos",
        "Into the Omniverse",
        "Isaac",
        "Jetson",
        "Omniverse",
        "Open Source",
        "Physical AI"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "GeForce NOW Brings GeForce RTX Gaming to Linux PCs",
      "url": "https://blogs.nvidia.com/blog/geforce-now-thursday-linux/",
      "date": "2026-01-29",
      "summary": "Get ready to game — the native GeForce NOW app for Linux PCs is now available in beta, letting Linux desktops tap directly into GeForce RTX performance from the cloud. Alongside the expansion comes ten new games, including The Bard’s Tale IV: Director’s Cut and The Bard’s Tale Trilogy for a leveled-up gaming weekend. And",
      "author": "GeForce NOW Community",
      "categories": [
        "Gaming",
        "Cloud Gaming",
        "GeForce NOW"
      ],
      "collected_at": "2026-02-24 01:15:31"
    },
    {
      "source": "NVIDIA Blog",
      "title": "Accelerating Science: A Blueprint for a Renewed National Quantum Initiative",
      "url": "https://blogs.nvidia.com/blog/national-quantum-initiative/",
      "date": "2026-01-28",
      "summary": "Quantum technologies are rapidly emerging as foundational capabilities for economic competitiveness, national security and scientific leadership in the 21st century. Sustained U.S. leadership in quantum information science is critical to ensuring that breakthroughs in computing, sensing, networking and materials translate into secure technologies and industries, a skilled domestic workforce and long-term strategic advantage. To secure",
      "author": "Krysta Svore",
      "categories": [
        "Corporate",
        "Quantum Computing"
      ],
      "collected_at": "2026-02-24 01:15:31"
    }
  ]
}